Enums/бит_ТипыВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыВариантовОтчетов</Name>
			<Comment>Типы вариантов отчетов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предопределенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВарианта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/бит_ВариантыОтчета/Ext/Module.bsl
#Область РаботаСВариантамиОтчета

Процедура ОбновитьПредопределенныеВарианты(КлючОбъекта   = Неопределено) Экспорт
	
	ТекущийПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	// Описание типов строка.
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипаСтрока50  = Новый ОписаниеТипов(МассивТипов,, Новый КвалификаторыСтроки(50));
	ОписаниеТипаСтрока256 = Новый ОписаниеТипов(МассивТипов,, Новый КвалификаторыСтроки(256));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.бит_ТипыВариантовОтчетов"));
	ОписаниеТипаТипыВариантов = Новый ОписаниеТипов(МассивТипов);
	
	// Таблица вариантов для проверки.
	ТаблицаВариантов = Новый ТаблицаЗначений;
	ТаблицаВариантов.Колонки.Добавить("КлючОбъекта" , ОписаниеТипаСтрока256);
	ТаблицаВариантов.Колонки.Добавить("КлючВарианта", ОписаниеТипаСтрока256);
	ТаблицаВариантов.Колонки.Добавить("Наименование", ОписаниеТипаСтрока50);
	ТаблицаВариантов.Колонки.Добавить("ТипВарианта" , ОписаниеТипаТипыВариантов);
	ТаблицаВариантов.Колонки.Добавить("Настройки");
	ТаблицаВариантов.Колонки.Добавить("СписокПользователей");
		
	Если КлючОбъекта <> Неопределено Тогда
		
		ИмяОтчета = СтрЗаменить(КлючОбъекта, "Отчет.", "");
		МетаОтчет = Метаданные.Отчеты[ИмяОтчета];
		
		ДополнитьТаблицуВариантовДляОтчета(ТаблицаВариантов, КлючОбъекта, ИмяОтчета, МетаОтчет);
		
	Иначе
		
		Для каждого МетаОтчет Из Метаданные.Отчеты Цикл
			
			// Проверка имени отчета (Обрабатываются только отчеты БИТ).
			ИмяОтчета = МетаОтчет.Имя;
			
			Если Найти(ИмяОтчета, "бит_") = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КлючОбъекта = "Отчет." + СокрЛП(ИмяОтчета);
			
			ДополнитьТаблицуВариантовДляОтчета(ТаблицаВариантов, КлючОбъекта, ИмяОтчета, МетаОтчет);
			
		КонецЦикла;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////
	// ЗАПИСЬ ВАРИАНТОВ.
	Если ТаблицаВариантов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаВариантов", ТаблицаВариантов);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетаТаблицаВариантов.КлючОбъекта,
		|	МетаТаблицаВариантов.КлючВарианта,
		|	МетаТаблицаВариантов.ТипВарианта,
		|   МетаТаблицаВариантов.Наименование
		|ПОМЕСТИТЬ ТабВариантов
		|ИЗ
		|	&ТаблицаВариантов КАК МетаТаблицаВариантов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабВариантов.КлючОбъекта,
		|	ТабВариантов.КлючВарианта,
		|	ТабВариантов.ТипВарианта,
		|	ТабВариантов.Наименование
		|ИЗ
		|	ТабВариантов КАК ТабВариантов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
		|		ПО ТабВариантов.КлючОбъекта = бит_ВариантыОтчетов.КлючОбъекта
		|		И ТабВариантов.КлючВарианта = бит_ВариантыОтчетов.КлючВарианта
		|ГДЕ
		|	бит_ВариантыОтчетов.Ссылка ЕСТЬ NULL";
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЭлемСправочника = Справочники.бит_ВариантыОтчетов.СоздатьЭлемент();
			// Заполнение реквизитов: Наименование, КлючОбъекта, КлючВарианта, ТипВарианта.
			ЗаполнитьЗначенияСвойств(ЭлемСправочника, Выборка);
			ЭлемСправочника.Ответственный = ТекущийПользователь;
					
			ОтборСтрок = Новый Структура("КлючОбъекта, КлючВарианта", 
											Выборка.КлючОбъекта, 
											Выборка.КлючВарианта);
			МассивСтрок = ТаблицаВариантов.НайтиСтроки(ОтборСтрок);
			Если МассивСтрок.Количество() > 0 Тогда
				
				// Настройки компоновки данных для варианта.
				НастройкиВарианта = МассивСтрок[0].Настройки;
				
				ЭлемСправочника.ХранилищеВарианта = Новый ХранилищеЗначения(НастройкиВарианта);
				
			КонецЕсли;
			
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлемСправочника);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьПредопределенныеВарианты()

Процедура ДополнитьТаблицуВариантовДляОтчета(ТаблицаВариантов, КлючОбъекта, ИмяОтчета, МетаОтчет)
	
	// Проверка того, что отчёт работает с хранилищем вариантов.
	Если МетаОтчет.ХранилищеВариантов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Макеты отчёта.
	МетаМакеты = МетаОтчет.Макеты;
	Для каждого МетаМакет Из МетаМакеты Цикл
		
		// Рассматриваем только макеты типа СКД.
		Если МетаМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.СхемаКомпоновкиДанных Тогда
			
			ИмяСКД = МетаМакет.Имя;
			
			Макет = Отчеты[ИмяОтчета].ПолучитьМакет(ИмяСКД);
			
			// Предопределенные варианты.
			Для каждого ПредопределенныйВариант Из Макет.ВариантыНастроек Цикл
				
				СтрокаТаблицы = ТаблицаВариантов.Добавить();
				КлючВарианта = ПредопределенныйВариант.Имя;
				
				СтрокаТаблицы.КлючОбъекта  = КлючОбъекта;
				СтрокаТаблицы.КлючВарианта = КлючВарианта;
				СтрокаТаблицы.Наименование = ПредопределенныйВариант.Представление;
				СтрокаТаблицы.ТипВарианта  = Перечисления.бит_ТипыВариантовОтчетов.Предопределенный;
				
				НастройкиВарианта = ПредопределенныйВариант.Настройки;
				
				СтрокаТаблицы.Настройки = НастройкиВарианта;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьВариантыДляОтчета()

#КонецОбласти
